ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l111x/GPIOB_1.0.xml
    <group id="GPIOB_CPU_INT" name="GPIOB_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="GPIOB_CPU_INT_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No bit is set means there is no pending interrupt request"/>
                <bitenum id="DIO0" value="0x1" description="DIO0 interrupt"/>
                <bitenum id="DIO1" value="0x2" description="DIO1 interrupt"/>
                <bitenum id="DIO2" value="0x3" description="DIO2 interrupt"/>
                <bitenum id="DIO3" value="0x4" description="DIO3 interrupt"/>
                <bitenum id="DIO4" value="0x5" description="DIO4 interrupt"/>
                <bitenum id="DIO5" value="0x6" description="DIO5 interrupt"/>
                <bitenum id="DIO6" value="0x7" description="DIO6 interrupt"/>
                <bitenum id="DIO7" value="0x8" description="DIO7 interrupt"/>
                <bitenum id="DIO8" value="0x9" description="DIO8 interrupt"/>
                <bitenum id="DIO9" value="0xA" description="DIO9 interrupt"/>
                <bitenum id="DIO10" value="0xB" description="DIO10 interrupt"/>
                <bitenum id="DIO11" value="0xC" description="DIO11 interrupt"/>
                <bitenum id="DIO12" value="0xD" description="DIO12 interrupt"/>
                <bitenum id="DIO13" value="0xE" description="DIO13 interrupt"/>
                <bitenum id="DIO14" value="0xF" description="DIO14 interrupt"/>
                <bitenum id="DIO15" value="0x10" description="DIO15 interrupt"/>
                <bitenum id="DIO16" value="0x11" description="DIO16 interrupt"/>
                <bitenum id="DIO17" value="0x12" description="DIO17 interrupt"/>
                <bitenum id="DIO18" value="0x13" description="DIO18 interrupt"/>
                <bitenum id="DIO19" value="0x14" description="DIO19 interrupt"/>
                <bitenum id="DIO20" value="0x15" description="DIO20 interrupt"/>
                <bitenum id="DIO21" value="0x16" description="DIO21 interrupt"/>
                <bitenum id="DIO22" value="0x17" description="DIO22 interrupt"/>
                <bitenum id="DIO23" value="0x18" description="DIO23 interrupt"/>
                <bitenum id="DIO24" value="0x19" description="DIO24 interrupt"/>
                <bitenum id="DIO25" value="0x1A" description="DIO25 interrupt"/>
                <bitenum id="DIO26" value="0x1B" description="DIO26 interrupt"/>
                <bitenum id="DIO27" value="0x1C" description="DIO27 interrupt"/>
                <bitenum id="DIO28" value="0x1D" description="DIO28 interrupt"/>
                <bitenum id="DIO29" value="0x1E" description="DIO29 interrupt"/>
                <bitenum id="DIO30" value="0x1F" description="DIO30 interrupt"/>
                <bitenum id="DIO31" value="0x20" description="DIO31 interrupt"/>
            </bitfield>
        </register>
        <register id="GPIOB_CPU_INT_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="DIO0" description="DIO0 event mask" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO1" description="DIO1 event mask" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO2" description="DIO2 event mask" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO3" description="DIO3 event mask" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO4" description="DIO4 event mask" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO5" description="DIO5 event mask" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO6" description="DIO6 event mask" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO7" description="DIO7 event mask" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO8" description="DIO8 event mask" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO9" description="DIO9 event mask" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO10" description="DIO10 event mask" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO11" description="DIO11 event mask" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO12" description="DIO12 event mask" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO13" description="DIO13 event mask" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO14" description="DIO14 event mask" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO15" description="DIO15 event mask" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO16" description="DIO16 event mask" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO17" description="DIO17 event mask" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO18" description="DIO18 event mask" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO19" description="DIO19 event mask" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO20" description="DIO20 event mask" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO21" description="DIO21 event mask" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO22" description="DIO22 event mask" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO23" description="DIO23 event mask" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO24" description="DIO24 event mask" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO25" description="DIO25 event mask" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO26" description="DIO26 event mask" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO27" description="DIO27 event mask" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO28" description="DIO28 event mask" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO29" description="DIO29 event mask" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO30" description="DIO30 event mask" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO31" description="DIO31 event mask" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
        </register>
