ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l111x/GPIOB_1.0.xml
        </group>
    <group id="GPIOB_GEN_EVENT1" name="GPIOB_GEN_EVENT1" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="GPIOB_GEN_EVENT1_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No bit is set means there is no pending interrupt request"/>
                <bitenum id="DIO16" value="0x1" description="DIO0 interrupt"/>
                <bitenum id="DIO17" value="0x2" description="DIO1 interrupt"/>
                <bitenum id="DIO18" value="0x3" description="DIO2 interrupt"/>
                <bitenum id="DIO19" value="0x4" description="DIO3 interrupt"/>
                <bitenum id="DIO20" value="0x5" description="DIO4 interrupt"/>
                <bitenum id="DIO21" value="0x6" description="DIO5 interrupt"/>
                <bitenum id="DIO22" value="0x7" description="DIO6 interrupt"/>
                <bitenum id="DIO23" value="0x8" description="DIO7 interrupt"/>
                <bitenum id="DIO24" value="0x9" description="DIO8 interrupt"/>
                <bitenum id="DIO25" value="0xA" description="DIO9 interrupt"/>
                <bitenum id="DIO26" value="0xB" description="DIO10 interrupt"/>
                <bitenum id="DIO27" value="0xC" description="DIO11 interrupt"/>
                <bitenum id="DIO28" value="0xD" description="DIO12 interrupt"/>
                <bitenum id="DIO29" value="0xE" description="DIO13 interrupt"/>
                <bitenum id="DIO30" value="0xF" description="DIO14 interrupt"/>
                <bitenum id="DIO31" value="0x10" description="DIO15 interrupt"/>
            </bitfield>
        </register>
        <register id="GPIOB_GEN_EVENT1_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="DIO16" description="DIO16 event mask" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO17" description="DIO17 event mask" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO18" description="DIO18 event mask" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO19" description="DIO19 event mask" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO20" description="DIO20 event mask" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO21" description="DIO21 event mask" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO22" description="DIO22 event mask" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO23" description="DIO23 event mask" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO24" description="DIO24 event mask" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO25" description="DIO25 event mask" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO26" description="DIO26 event mask" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO27" description="DIO27 event mask" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO28" description="DIO28 event mask" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO29" description="DIO29 event mask" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO30" description="DIO30 event mask" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
            <bitfield id="DIO31" description="DIO31 event mask" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Event is masked"/>
                <bitenum id="SET" value="0x1" description="Event is unmasked"/>
            </bitfield>
        </register>
        <register id="GPIOB_GEN_EVENT1_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="DIO16" description="DIO16 event" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO16 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO16 event occurred"/>
            </bitfield>
            <bitfield id="DIO17" description="DIO17 event" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO17 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO17 event occurred"/>
            </bitfield>
            <bitfield id="DIO18" description="DIO18 event" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO18 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO18 event occurred"/>
            </bitfield>
            <bitfield id="DIO19" description="DIO19 event" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO19 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO19 event occurred"/>
            </bitfield>
            <bitfield id="DIO20" description="DIO20 event" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO20 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO20 event occurred"/>
            </bitfield>
            <bitfield id="DIO21" description="DIO21 event" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO21 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO21 event occurred"/>
            </bitfield>
            <bitfield id="DIO22" description="DIO22 event" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO22 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO22 event occurred"/>
            </bitfield>
            <bitfield id="DIO23" description="DIO23 event" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO23 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO23 event occurred"/>
            </bitfield>
            <bitfield id="DIO24" description="DIO24 event" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO24 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO24 event occurred"/>
            </bitfield>
            <bitfield id="DIO25" description="DIO25 event" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO25 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO25 event occurred"/>
            </bitfield>
            <bitfield id="DIO26" description="DIO26 event" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO26 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO26 event occurred"/>
            </bitfield>
            <bitfield id="DIO27" description="DIO27 event" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO27 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO27 event occurred"/>
            </bitfield>
            <bitfield id="DIO28" description="DIO28 event" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO28 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO28 event occurred"/>
            </bitfield>
            <bitfield id="DIO29" description="DIO29 event" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO29 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO29 event occurred"/>
            </bitfield>
            <bitfield id="DIO30" description="DIO30 event" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO30 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO30 event occurred"/>
            </bitfield>
            <bitfield id="DIO31" description="DIO31 event" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO31 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO31 event occurred"/>
            </bitfield>
        </register>
        <register id="GPIOB_GEN_EVENT1_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="DIO16" description="DIO16 event" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO16 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO16 event occurred"/>
            </bitfield>
            <bitfield id="DIO17" description="DIO17 event" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO17 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO17 event occurred"/>
            </bitfield>
            <bitfield id="DIO18" description="DIO18 event" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO18 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO18 event occurred"/>
            </bitfield>
            <bitfield id="DIO19" description="DIO19 event" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO19 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO19 event occurred"/>
            </bitfield>
            <bitfield id="DIO20" description="DIO20 event" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO20 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO20 event occurred"/>
            </bitfield>
            <bitfield id="DIO21" description="DIO21 event" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO21 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO21 event occurred"/>
            </bitfield>
            <bitfield id="DIO22" description="DIO22 event" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO22 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO22 event occurred"/>
            </bitfield>
            <bitfield id="DIO23" description="DIO23 event" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO23 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO23 event occurred"/>
            </bitfield>
            <bitfield id="DIO24" description="DIO24 event" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO24 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO24 event occurred"/>
            </bitfield>
            <bitfield id="DIO25" description="DIO25 event" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO25 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO25 event occurred"/>
            </bitfield>
            <bitfield id="DIO26" description="DIO26 event" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO26 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO26 event occurred"/>
            </bitfield>
            <bitfield id="DIO27" description="DIO27 event" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO27 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO27 event occurred"/>
            </bitfield>
            <bitfield id="DIO28" description="DIO28 event" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO28 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO28 event occurred"/>
            </bitfield>
            <bitfield id="DIO29" description="DIO29 event" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO29 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO29 event occurred"/>
            </bitfield>
            <bitfield id="DIO30" description="DIO30 event" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO30 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO30 event occurred"/>
            </bitfield>
            <bitfield id="DIO31" description="DIO31 event" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="DIO31 event did not occur"/>
                <bitenum id="SET" value="0x1" description="DIO31 event occurred"/>
            </bitfield>
        </register>
        <register id="GPIOB_GEN_EVENT1_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="DIO16" description="DIO16 event" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO16 in RIS register"/>
            </bitfield>
            <bitfield id="DIO17" description="DIO17 event" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO17 in RIS register"/>
            </bitfield>
            <bitfield id="DIO18" description="DIO18 event" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO18 in RIS register"/>
            </bitfield>
            <bitfield id="DIO19" description="DIO19 event" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO19 in RIS register"/>
            </bitfield>
            <bitfield id="DIO20" description="DIO20 event" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO20 in RIS register"/>
            </bitfield>
            <bitfield id="DIO21" description="DIO21 event" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO21 in RIS register"/>
            </bitfield>
            <bitfield id="DIO22" description="DIO22 event" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO22 in RIS register"/>
            </bitfield>
            <bitfield id="DIO23" description="DIO23 event" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO23 in RIS register"/>
            </bitfield>
            <bitfield id="DIO24" description="DIO24 event" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO24 in RIS register"/>
            </bitfield>
            <bitfield id="DIO25" description="DIO25 event" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO25 in RIS register"/>
            </bitfield>
            <bitfield id="DIO26" description="DIO26 event" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO26 in RIS register"/>
            </bitfield>
            <bitfield id="DIO27" description="DIO27 event" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO27 in RIS register"/>
            </bitfield>
            <bitfield id="DIO28" description="DIO28 event" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO28 in RIS register"/>
            </bitfield>
            <bitfield id="DIO29" description="DIO29 event" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO29 in RIS register"/>
            </bitfield>
            <bitfield id="DIO30" description="DIO30 event" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO30 in RIS register"/>
            </bitfield>
            <bitfield id="DIO31" description="DIO31 event" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO31 in RIS register"/>
            </bitfield>
        </register>
